EDT/УТ/src/InformationRegisters/ПараметрыРегламентныхЗаданий/ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/МылоОдминов/МылоОдминов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МылоОдминов</name>
  <dimensions>
    <name>ИмяОдмина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Мыло</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ПунктыПВЗ/ПунктыПВЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПунктыПВЗ</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>КодПВЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАдминки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/CommonModules/РаботаСПВЗСервер/Module.bsl
//Асеев 30.09.2021 (Задача № 4665)>>>
Функция СоздатьПВЗ(СтруктураПВЗ) Экспорт
	
	ПунктПВЗ = Справочники.ПунктыПВЗ.НайтиПоРеквизиту("КодАдминки", СтруктураПВЗ.pickupPointID_Ч);
	Если ПунктПВЗ.Пустая() Тогда
		
		ПВЗ = Справочники.ПунктыПВЗ.СоздатьЭлемент();
		ПВЗ.КодАдминки = СтруктураПВЗ.pickupPointID_Ч;
		ПВЗ.КодПВЗ = СтруктураПВЗ.pnt_externalId;
		ПВЗ.Наименование = СтруктураПВЗ.pnt_name;
		ПВЗ.Адрес = СтруктураПВЗ.pnt_address;
		ПВЗ.Владелец = Справочники.Контрагенты.НайтиПоКоду("Shop_" + Формат(СтруктураПВЗ.pnt_shopId_Ч, "ЧН=0; ЧГ="));
		ПВЗ.Записать();
		
		ПунктПВЗ = ПВЗ.Ссылка;
	КонецЕсли;
	Возврат ПунктПВЗ;
	
КонецФункции

Функция ЗагрузитьДанныеПВЗ(ДатаЗапроса)
	
	Подключение = Евген.СоздатьПодключениеКИнтернетМагазину();
	
	ТекстЗапроса =
	"select
	|pnt.id AS pickupPointID,
	|pnt.externalId AS pnt_externalId,
	|pnt.name AS pnt_name,
	|pnt.address AS pnt_address,
	|pnt_stgs.internetShopID AS pnt_shopId
	|from
	|	pickuppoint pnt (NOLOCK)
	|inner join
	|	settings pnt_stgs (NOLOCK) on pnt.settingId = pnt_stgs.shopId
	|where
	|	pnt.modifyDate > '" + Евген.ДатаВSQL(ДатаЗапроса, Ложь) + "'
	|";
	
	RS = Евген.ЗапросКИнтернетМагазину(ТекстЗапроса, Подключение);
	
	ДанныеПВЗ = Евген.СоздатьТаблицу(RS, "pickupPointID_Ч,pnt_externalId,pnt_name,pnt_address,pnt_shopId_Ч"); 
	
	RS = 0;
	
	Если Не ДанныеПВЗ.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	РезультатВыполнения = Истина;
	
	СтруктураПВЗ = Новый Структура("pickupPointID_Ч,pnt_externalId,pnt_name,pnt_address,pnt_shopId_Ч");
	
	Для Каждого ПВЗ Из ДанныеПВЗ Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПВЗ, ПВЗ);
		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ПунктыПВЗ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			БлокировкаДанных.Заблокировать();
			
			СоздатьПВЗ(СтруктураПВЗ);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			РезультатВыполнения = Ложь;
		КонецПопытки;
		
	КонецЦикла;

	Возврат РезультатВыполнения;
	
КонецФункции
//Асеев 30.09.2021 (Задача № 4665)<<<

Процедура РегламентЗагрузкаДанныхПВЗ() Экспорт
	
	//Асеев 30.09.2021 (Задача № 4665)>>>
	ЗаписьРегистра = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Ключ = "ПоследняяДатаЗагрузкиПВЗ";
	ЗаписьРегистра.Прочитать();
	
	
	Попытка
		ДатаЗапроса = Вычислить("'" + ЗаписьРегистра.Значение + "'");
	Исключение
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МылоОдминов.Мыло КАК Мыло
		|ИЗ
		|	РегистрСведений.МылоОдминов КАК МылоОдминов";
		lem.ОтправитьСообщение(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Мыло"), "РегламентЗагрузкаДанныхПВЗ", "Ошибочное значение даты последней загрузки тарифов (РегистрСведений.ПараметрыРегламентныхЗаданий, Ключ=ПоследняяДатаЗагрузкиПВЗ)");
		
		Возврат;
	КонецПопытки;
	
	ДатаВызова = ТекущаяДата();
	
	//ДатаЗапроса = '20200101';
	//ДатаЗапроса = ТекущаяДата();
	
	Если ЗагрузитьДанныеПВЗ(ДатаЗапроса) Тогда
		
		ЗаписьРегистра = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Ключ = "ПоследняяДатаЗагрузкиПВЗ";
		ЗаписьРегистра.Значение = Формат(ДатаВызова, "ДФ=yyyyMMddHHmmss");
		ЗаписьРегистра.Записать();
		
	КонецЕсли;
	
	//Асеев 30.09.2021 (Задача № 4665)<<<	
	
КонецПроцедуры
